cristianoag/esp32_clones/software/esp32_msx_emulator/lib/fmsx/fMSX/MSX.c
  /* Try loading RS232 support ROM to slot */
  if(!DiskROMAvailable()&&(P=LoadROM("RS232.ROM",0x4000,0)))
  {
    if(Verbose) printf("RS232.ROM..");
    MemMap[3][3][2]=P;
    MemMap[3][3][3]=P+0x2000;
  }

  PRINTOK;

  /* Start loading system cartridges */
  J=MAXCARTS;

  /* If MSX2 or better and DiskROM present...  */
  /* ...try loading MSXDOS2 cartridge into 3:0 */
  if(!MODEL(MSX_MSX1)&&OPTION(MSX_MSXDOS2)&&DiskROMAvailable()&&!ROMData[2])
    if(LoadCart("MSXDOS2.ROM",2,MAP_GEN16))
      SetMegaROM(2,0,1,ROMMask[J]-1,ROMMask[J]);

  /* If MSX2 or better, load PAINTER cartridge */
  if(!MODEL(MSX_MSX1))
  {
    for(;(J<MAXSLOTS)&&ROMData[J];++J);
    if((J<MAXSLOTS)&&LoadCart("PAINTER.ROM",J,0)) ++J;
  }

  /* Load FMPAC cartridge */
  for(;(J<MAXSLOTS)&&ROMData[J];++J);
  if((J<MAXSLOTS)&&LoadCart("FMPAC.ROM",J,MAP_FMPAC)) ++J;

  /* Load Konami GameMaster2/GameMaster cartridges */
  for(;(J<MAXSLOTS)&&ROMData[J];++J);
  if(J<MAXSLOTS)
  {
    if(LoadCart("GMASTER2.ROM",J,MAP_GMASTER2)) ++J;
    else if(LoadCart("GMASTER.ROM",J,0)) ++J;
  }

  /* We are now back to working directory */
  if(WorkDir && chdir(WorkDir))
  { if(Verbose) printf("Failed changing to '%s' directory!\n",WorkDir); }

  /* Explicit user cartridges are required, never an optional BASIC fallback. */
  for(J=0;J<MAXCARTS;++J)
    if(ROMName[J]&&!LoadCart(ROMName[J],J,ROMGUESS(J)|ROMTYPE(J))) return(0);

  /* Open stream for a printer */
  if(Verbose)
    printf("Redirecting printer output to %s...OK\n",PrnName? PrnName:"STDOUT");
  ChangePrinter(PrnName);

  /* Open streams for serial IO */
  if(!ComName) { ComIStream=stdin;ComOStream=stdout; }
  else
  {
    if(Verbose) printf("Redirecting serial I/O to %s...",ComName);
    if(!(ComOStream=ComIStream=fopen(ComName,"r+b")))
    { ComIStream=stdin;ComOStream=stdout; }
    PRINTRESULT(ComOStream!=stdout);
  }

  /* Open casette image */
  if(CasName&&!ChangeTape(CasName)) return(0);

  /* Initialize floppy disk controller */
  Reset1793(&FDC,FDD,WD1793_INIT);
  FDC.Verbose=Verbose&0x04;

  /* Open disk images */
  for(J=0;J<MAXDRIVES;++J)
  {
    FDD[J].Verbose=Verbose&0x04;
    if(!ChangeDisk(J,DSKName[J])) return(0);
  }

  /* Initialize sound logging */
  InitMIDI(SndName);

  /* Done with initialization */
  if(Verbose)
  {
    printf("Initializing VDP, FDC, PSG, OPLL, SCC, and CPU...\n");
    printf("  Attached %s to joystick port A\n",JoyTypes[JOYTYPE(0)]);
    printf("  Attached %s to joystick port B\n",JoyTypes[JOYTYPE(1)]);
    printf("  %d CPU cycles per HBlank\n",HPeriod);
    printf("  %d CPU cycles per VBlank\n",VPeriod);
    printf("  %d scanlines\n",VPeriod/HPeriod);
  }

  /* Start execution of the code */
  if(Verbose) printf("RUNNING ROM CODE...\n");
  A=RunZ80(&CPU);

  /* Exiting emulation... */
  if(Verbose) printf("EXITED at PC = %04Xh.\n",A);
  return(1);
}

/** TrashMSX() ***********************************************/
/** Free resources allocated by StartMSX().                 **/
/*************************************************************/
void TrashMSX(void)
{
  FILE *F;
  int J;

  /* CMOS.ROM is saved in the program directory */
  if(ProgDir && chdir(ProgDir))
  { if(Verbose) printf("Failed changing to '%s' directory!\n",ProgDir); }

  /* Save CMOS RAM, if present */
  if(SaveCMOS)
  {
    if(Verbose) printf("Writing CMOS.ROM...");
    if(!(F=fopen("CMOS.ROM","wb"))) SaveCMOS=0;
    else
    {
      if(fwrite(RTC,1,sizeof(RTC),F)!=sizeof(RTC)) SaveCMOS=0;
      fclose(F);
    }
    PRINTRESULT(SaveCMOS);
  }

  /* Change back to working directory */
  if(WorkDir && chdir(WorkDir))
  { if(Verbose) printf("Failed changing to '%s' directory!\n",WorkDir); }

  /* Shut down sound logging */
  TrashMIDI();

  /* Eject disks, free disk buffers */
  Reset1793(&FDC,FDD,WD1793_EJECT);

  /* Close printer output */
  ChangePrinter(0);

  /* Close tape */
  ChangeTape(0);
  
  /* Close all IO streams */
  if(ComOStream&&(ComOStream!=stdout)) fclose(ComOStream);
  if(ComIStream&&(ComIStream!=stdin))  fclose(ComIStream);

  /* Eject all cartridges (will save SRAM) */
  for(J=0;J<MAXSLOTS;++J) LoadCart(0,J,ROMType[J]);

  /* Eject all disks */
  for(J=0;J<MAXDRIVES;++J) ChangeDisk(J,0);

  /* Free all remaining allocated memory */
  FreeAllMemory();
  Kanji=0;
  KanjiSize=0;
  OmegaBankLoaded=PanasonicBankLoaded=0;
  KanLetter=KanCount=KanWriteLevel=0;
  MemMap[0][0][4]=MemMap[0][0][5]=0;
  RAM[4]=RAM[5]=0;
}

/* Unlike legacy optional ROMs, an existing logo must load completely. */
static int LoadLogoROM(byte **Logo)
{
  FILE *F;
  byte *P;
  int Error;

  *Logo=0;
  if(!(F=fopen("MSX2PLOGO.ROM","rb"))) return(errno==ENOENT);
  if(!(P=GetCpuMemory(0x4000)))
  {
    fclose(F);
    errno=ENOMEM;
    return(0);
  }
  Error=0;
  if(fread(P,1,0x4000,F)!=0x4000) Error=ferror(F)? EIO:EINVAL;
  else if(fgetc(F)!=EOF) Error=EINVAL;
  else if(ferror(F)) Error=EIO;
  if(fclose(F)&&!Error) Error=EIO;
  if(Error)
  {
    FreeMemory(P);
    errno=Error;
    return(0);
  }
  *Logo=P;
  return(1);
}

/* The sub-ROM is followed by Kanji BASIC, which contains the original MSX2+
 * startup animation. Preserve that contiguous 48 KiB mapping. */
static int LoadOmegaROM(byte **Main,byte **Ext,byte **Logo)
{
  static const long Offsets[3] = { 0,0x8000,0x10000 };
  static const int Sizes[3] = { 0x8000,0x4000,0xC000 };
  byte **Regions[3] = { Main,Logo,Ext };
  FILE *F;
  int J,Error;

  *Main=*Ext=*Logo=0;
  if(!(F=fopen("OMEGA.ROM","rb"))) return(errno==ENOENT? 0:-1);
  Error=0;
  if(fseek(F,0,SEEK_END)) Error=EIO;
  else if(ftell(F)!=0x40000) Error=EINVAL;
  for(J=0;J<3&&!Error;++J)
  {
    if(fseek(F,Offsets[J],SEEK_SET)) Error=EIO;
    else if(!(*Regions[J]=GetCpuMemory(Sizes[J]))) Error=ENOMEM;
    else if(fread(*Regions[J],1,Sizes[J],F)!=Sizes[J]) Error=EIO;
  }
  if(fclose(F)&&!Error) Error=EIO;
  if(Error)
  {
    FreeMemory(*Main);
    FreeMemory(*Ext);
    FreeMemory(*Logo);
    *Main=*Ext=*Logo=0;
    if(Verbose) printf("  Failed loading OMEGA.ROM (expected a 262144-byte flash bank).\n");
    errno=Error;
    return(-1);
  }
  return(1);
}

