cristianoag/esp32_clones/software/esp32_msx_emulator/lib/fmsx/fMSX/MSX.c
/* Headerless main (32K), sub + Kanji BASIC (48K), then JIS font (128/256K).
 * An existing combined image is authoritative, including on any load error. */
static int LoadPanasonicROM(byte **Main,byte **Ext,byte **Font,int *FontSize,int Model)
{
  byte **Regions[3] = { Main,Ext,Font };
  int Sizes[3] = { 0x8000,0xC000,0 };
  FILE *F,*Other;
  long Size;
  int J,Error;

  *Main=*Ext=*Font=0;
  *FontSize=0;
  if(!(F=fopen("PANASONIC.ROM","rb"))) return(errno==ENOENT? 0:-1);
  Error=0;
  Other=fopen("OMEGA.ROM","rb");
  if(Other) { fclose(Other);Error=EINVAL; }
  else if(errno!=ENOENT) Error=errno;
  if(!Error)
  {
    if(fseek(F,0,SEEK_END)) Error=EIO;
    else
    {
      Size=ftell(F);
      if((Size!=0x34000&&Size!=0x54000)||(Model==MSX_MSX2&&Size!=0x34000)) Error=EINVAL;
      else Sizes[2]=(int)Size-0x14000;
    }
    if(!Error&&fseek(F,0,SEEK_SET)) Error=EIO;
  }
  for(J=0;J<3&&!Error;++J)
  {
    if(!(*Regions[J]=GetCpuMemory(Sizes[J]))) Error=ENOMEM;
    else if(fread(*Regions[J],1,Sizes[J],F)!=Sizes[J]) Error=EIO;
  }
  if(!Error&&(fgetc(F)!=EOF||ferror(F))) Error=EIO;
  if(fclose(F)&&!Error) Error=EIO;
  if(Error)
  {
    FreeMemory(*Main);
    FreeMemory(*Ext);
    FreeMemory(*Font);
    *Main=*Ext=*Font=0;
    if(Verbose) printf("  Failed loading PANASONIC.ROM (expected 212992/344064 bytes, without OMEGA.ROM).\n");
    errno=Error;
    return(-1);
  }
  *FontSize=Sizes[2];
  return(1);
}

/** ResetMSX() ***********************************************/
/** Reset MSX hardware to new operating modes. Returns new  **/
/** modes, possibly not the same as NewMode.                **/
/*************************************************************/
int ResetMSX(int NewMode,int NewRAMPages,int NewVRAMPages)
{
  /*** VDP status register states: ***/
  static const byte VDPSInit[16] = { 0x9F,0,0x6C,0,0,0,0,0,0,0,0,0,0,0,0,0 };

  /*** VDP control register states: ***/
  static const byte VDPInit[64]  =
  {
    0x00,0x10,0xFF,0xFF,0xFF,0xFF,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00
  };

  /*** Initial palette: ***/
  static const unsigned int PalInit[16] =
  {
    0x00000000,0x00000000,0x0020C020,0x0060E060,
    0x002020E0,0x004060E0,0x00A02020,0x0040C0E0,
    0x00E02020,0x00E06060,0x00C0C020,0x00C0C080,
    0x00208020,0x00C040A0,0x00A0A0A0,0x00E0E0E0
  };

  byte *P1,*P2,*P3;
  int J,I,FontSize,Panasonic;

  /* If changing hardware model, load new system ROMs */
  if((Mode^NewMode)&MSX_MODEL)
  {
    /* Change to the program directory */
    if(ProgDir && chdir(ProgDir))
    { if(Verbose) printf("  Failed changing to '%s' directory!\n",ProgDir); }

    Panasonic=0;
    if((NewMode&MSX_MODEL)==MSX_MSX2||(NewMode&MSX_MODEL)==MSX_MSX2P)
      Panasonic=LoadPanasonicROM(&P1,&P2,&P3,&FontSize,NewMode&MSX_MODEL);
    if(Panasonic<0) return(Mode);
    if(Panasonic)
    {
      FreeMemory(MemMap[0][0][0]);
      FreeMemory(MemMap[3][1][0]);
      FreeMemory(MemMap[0][0][4]);
      if(!OmegaBankLoaded&&!PanasonicBankLoaded) FreeMemory(MemMap[3][1][2]);
      FreeMemory(Kanji);
      for(J=0;J<4;++J) MemMap[0][0][J]=P1+J*0x2000;
      MemMap[0][0][4]=MemMap[0][0][5]=EmptyRAM;
      for(J=0;J<6;++J) MemMap[3][1][J]=P2+J*0x2000;
      Kanji=P3;
      KanjiSize=FontSize;
      PanasonicBankLoaded=1;
      OmegaBankLoaded=0;
    }
    else switch(NewMode&MSX_MODEL)
    {
      case MSX_MSX1:
        if(Verbose) printf("  Opening MSX.ROM...");
        P1=LoadROM("MSX.ROM",0x8000,0);
        PRINTRESULT(P1);
        if(!P1) NewMode=(NewMode&~MSX_MODEL)|(Mode&MSX_MODEL);
        else
        {
          if(OmegaBankLoaded||PanasonicBankLoaded) for(J=2;J<6;++J) MemMap[3][1][J]=EmptyRAM;
          OmegaBankLoaded=0;
          FreeMemory(MemMap[0][0][0]);
          FreeMemory(MemMap[3][1][0]);
          MemMap[0][0][0]=P1;
          MemMap[0][0][1]=P1+0x2000;
          MemMap[0][0][2]=P1+0x4000;
          MemMap[0][0][3]=P1+0x6000;
          MemMap[3][1][0]=EmptyRAM;
          MemMap[3][1][1]=EmptyRAM;
        }
        break;

      case MSX_MSX2:
        if(Verbose) printf("  Opening MSX2.ROM...");
        P1=LoadROM("MSX2.ROM",0x8000,0);
        PRINTRESULT(P1);
        if(Verbose) printf("  Opening MSX2EXT.ROM...");
        P2=LoadROM("MSX2EXT.ROM",0x4000,0);
        PRINTRESULT(P2);
        if(!P1||!P2) 
        {
          NewMode=(NewMode&~MSX_MODEL)|(Mode&MSX_MODEL);
          FreeMemory(P1);
          FreeMemory(P2);
        }
        else
        {
          if(OmegaBankLoaded||PanasonicBankLoaded) for(J=2;J<6;++J) MemMap[3][1][J]=EmptyRAM;
          OmegaBankLoaded=0;
          FreeMemory(MemMap[0][0][0]);
          FreeMemory(MemMap[3][1][0]);
          MemMap[0][0][0]=P1;
          MemMap[0][0][1]=P1+0x2000;
          MemMap[0][0][2]=P1+0x4000;
          MemMap[0][0][3]=P1+0x6000;
          MemMap[3][1][0]=P2;
          MemMap[3][1][1]=P2+0x2000;
        }
        break;

      case MSX_MSX2P:
        I=LoadOmegaROM(&P1,&P2,&P3);
        if(I<0) return(Mode);
        if(!I)
        {
          if(Verbose) printf("  Opening MSX2P.ROM...");
          P1=LoadROM("MSX2P.ROM",0x8000,0);
          PRINTRESULT(P1);
          if(Verbose) printf("  Opening MSX2PEXT.ROM...");
          P2=LoadROM("MSX2PEXT.ROM",0x4000,0);
          PRINTRESULT(P2);
          if(P1&&P2&&!LoadLogoROM(&P3))
          {
            I=errno;
            FreeMemory(P1);
            FreeMemory(P2);
            if(Verbose) printf("  Failed loading MSX2PLOGO.ROM (expected 16384 bytes).\n");
            errno=I;
            return(Mode);
          }
        }
        if(!P1||!P2) 
        {
          NewMode=(NewMode&~MSX_MODEL)|(Mode&MSX_MODEL);
          FreeMemory(P1);
          FreeMemory(P2);
        }
        else
        {
          if(OmegaBankLoaded||PanasonicBankLoaded) for(J=2;J<6;++J) MemMap[3][1][J]=EmptyRAM;
          OmegaBankLoaded=I>0;
          FreeMemory(MemMap[0][0][0]);
          FreeMemory(MemMap[3][1][0]);
          FreeMemory(MemMap[0][0][4]);
          MemMap[0][0][0]=P1;
          MemMap[0][0][1]=P1+0x2000;
          MemMap[0][0][2]=P1+0x4000;
          MemMap[0][0][3]=P1+0x6000;
          /* Optional auxiliary ROM in primary slot 0, not a cartridge. */
          MemMap[0][0][4]=P3? P3:EmptyRAM;
          MemMap[0][0][5]=P3? P3+0x2000:EmptyRAM;
          MemMap[3][1][0]=P2;
          MemMap[3][1][1]=P2+0x2000;
          if(OmegaBankLoaded)
            for(J=2;J<6;++J) MemMap[3][1][J]=P2+J*0x2000;
        }
        break;

      default:
        /* Unknown MSX model, keep old model */
        if(Verbose) printf("ResetMSX(): INVALID HARDWARE MODEL!\n");
        NewMode=(NewMode&~MSX_MODEL)|(Mode&MSX_MODEL);
        break;
    }

