cristianoag/esp32_clones/software/esp32_msx_emulator/lib/fmsx/fMSX/MSX.c
    /* Check joystick */
    JoyState=Joystick();

    /* Check keyboard */
    Keyboard();

    /* Exit emulation if requested */
    if(ExitNow) return(INT_QUIT);

    /* Check mouse in joystick port #1 */
    if(JOYTYPE(0)>=JOY_MOUSTICK)
    {
      /* Get new mouse state */
      MouState[0]=Mouse(0);
      /* Merge mouse buttons into joystick buttons */
      JoyState|=(MouState[0]>>12)&0x0030;
      /* If mouse-as-joystick... */
      if(JOYTYPE(0)==JOY_MOUSTICK)
      {
        J=MouState[0]&0xFF;
        JoyState|=J>OldMouseX[0]? 0x0008:J<OldMouseX[0]? 0x0004:0;
        OldMouseX[0]=J;
        J=(MouState[0]>>8)&0xFF;
        JoyState|=J>OldMouseY[0]? 0x0002:J<OldMouseY[0]? 0x0001:0;
        OldMouseY[0]=J;
      }
    }

    /* Check mouse in joystick port #2 */
    if(JOYTYPE(1)>=JOY_MOUSTICK)
    {
      /* Get new mouse state */
      MouState[1]=Mouse(1);
      /* Merge mouse buttons into joystick buttons */
      JoyState|=(MouState[1]>>4)&0x3000;
      /* If mouse-as-joystick... */
      if(JOYTYPE(1)==JOY_MOUSTICK)
      {
        J=MouState[1]&0xFF;
        JoyState|=J>OldMouseX[1]? 0x0800:J<OldMouseX[1]? 0x0400:0;
        OldMouseX[1]=J;
        J=(MouState[1]>>8)&0xFF;
        JoyState|=J>OldMouseY[1]? 0x0200:J<OldMouseY[1]? 0x0100:0;
        OldMouseY[1]=J;
      }
    }

    /* If any autofire options selected, run autofire counter */
    if(OPTION(MSX_AUTOSPACE|MSX_AUTOFIREA|MSX_AUTOFIREB))
      if((ACount=(ACount+1)&0x07)>3)
      {
        /* Autofire spacebar if needed */
        if(OPTION(MSX_AUTOSPACE)) KBD_RES(' ');
        /* Autofire FIRE-A if needed */
        if(OPTION(MSX_AUTOFIREA)) JoyState&=~(JST_FIREA|(JST_FIREA<<8));
        /* Autofire FIRE-B if needed */
        if(OPTION(MSX_AUTOFIREB)) JoyState&=~(JST_FIREB|(JST_FIREB<<8));
      }
  }

  /* Return whatever interrupt is pending */
  R->IRequest=IRQPending? INT_IRQ:INT_NONE;
  return(R->IRequest);
}

/** CheckSprites() *******************************************/
/** Check for sprite collisions.                            **/
/*************************************************************/
static void PrepareSpriteLine(unsigned int Y)
{
  byte Occupied[32] = {0};
  unsigned int I,Active=0,Width=Sprites16x16? 16:8,Zoom=BigSprites? 2:1;
  int X,Row,Pixel;
  byte *Attribute,*Pattern,Color,Bit;

  SpriteCollisionCursor=256;
  if(!ScreenON||SpritesOFF||!ScrMode||ScrMode>=MAXSCREEN+1||Y>=(ScanLines212? 212:192)) return;
  memset(SpriteCollisions,0,sizeof(SpriteCollisions));
  for(I=0;I<32;++I)
  {
    Attribute=SprTab+I*4;
    if(Attribute[0]==(ScrMode>3? 216:208)) break;
    Row=(byte)(Y+VScroll-Attribute[0]-1);
    if(Row>=(int)(Width*Zoom)) continue;
    if(++Active>(ScrMode>3? MAXSPRITE2:MAXSPRITE1)) break;
    Row/=Zoom;
    Color=ScrMode>3? SprTab[(int)I*16+Row-0x200]:Attribute[3];
    if((!(Color&15)&&!SolidColor0)||(ScrMode>3&&(Color&0x60))) continue;
    X=(int)Attribute[1]-(Color&0x80? 32:0);
    Pattern=SprGen+((Width==16? Attribute[2]&0xFC:Attribute[2])<<3)+Row;
    for(Pixel=0;Pixel<(int)Width;++Pixel)
    {
      Bit=Pattern[Pixel<8? 0:16]&(0x80>>(Pixel&7));
      if(Bit)
      {
        unsigned int Copy;
        for(Copy=0;Copy<Zoom;++Copy)
        {
          int ScreenX=X+Pixel*(int)Zoom+(int)Copy;
          if(ScreenX>=0&&ScreenX<256)
          {
            byte Mask=1<<(ScreenX&7);
            if(Occupied[ScreenX>>3]&Mask)
            {
              SpriteCollisions[ScreenX>>3]|=Mask;
              SpriteCollisionCursor=0;
            }
            Occupied[ScreenX>>3]|=Mask;
          }
        }
      }
    }
  }
}

static void SyncSpriteCollision(int X)
{
  int Pixel;

  if(X>256) X=256;
  if(X<=SpriteCollisionCursor) return;
  if(!(VDPStatus[0]&0x20))
    for(Pixel=SpriteCollisionCursor;Pixel<X;++Pixel)
      if(SpriteCollisions[Pixel>>3]&(1<<(Pixel&7)))
      {
        VDPStatus[0]|=0x20;
        if(!MODEL(MSX_MSX1))
        {
          VDPStatus[3]=(Pixel+12)&0xFF;
          VDPStatus[4]=(VDPStatus[4]&0xFE)|((Pixel+12)>>8);
          VDPStatus[5]=(ScanLine+8)&0xFF;
          VDPStatus[6]=(VDPStatus[6]&0xFC)|((ScanLine+8)>>8);
        }
        break;
      }
  /* A read acknowledges elapsed dots, never replaying an old overlap. */
  SpriteCollisionCursor=X;
}

int CheckSprites(void)
{
  unsigned int I,J,LS,LD;
  byte DH,DV,*S,*D,*PS,*PD,*T;

  /* Must be showing sprites */
  if(SpritesOFF||!ScrMode||(ScrMode>=MAXSCREEN+1)) return(0);

  /* Find bottom/top scanlines */
  DH = ScrMode>3? 216:208;
  LD = 255-(Sprites16x16? 16:8);
  LS = ScanLines212? 211:191;

  /* Find valid, displayed sprites */
  for(I=J=0,S=SprTab;(I<32)&&(S[0]!=DH);++I,S+=4)
    if((S[0]<LS)||(S[0]>LD)) J|=1<<I;

  if(Sprites16x16)
  {
    for(S=SprTab;J;J>>=1,S+=4)
      if(J&1)
        for(I=J>>1,D=S+4;I;I>>=1,D+=4)
          if(I&1) 
          {
            DV=S[0]-D[0];
            if((DV<16)||(DV>240))
	    {
              DH=S[1]-D[1];
              if((DH<16)||(DH>240))
	      {
                PS=SprGen+((int)(S[2]&0xFC)<<3);
                PD=SprGen+((int)(D[2]&0xFC)<<3);
                if(DV<16) PD+=DV; else { DV=256-DV;PS+=DV; }
                if(DH>240) { DH=256-DH;T=PS;PS=PD;PD=T; }
                while(DV<16)
                {
                  LS=((unsigned int)*PS<<8)+*(PS+16);
                  LD=((unsigned int)*PD<<8)+*(PD+16);
                  if(LD&(LS>>DH)) break;
                  else { ++DV;++PS;++PD; }
                }
                if(DV<16) return(1);
              }
            }
          }
  }
  else
  {
    for(S=SprTab;J;J>>=1,S+=4)
      if(J&1)
        for(I=J>>1,D=S+4;I;I>>=1,D+=4)
          if(I&1) 
          {
            DV=S[0]-D[0];
            if((DV<8)||(DV>248))
            {
              DH=S[1]-D[1];
              if((DH<8)||(DH>248))
              {
                PS=SprGen+((int)S[2]<<3);
                PD=SprGen+((int)D[2]<<3);
                if(DV<8) PD+=DV; else { DV=256-DV;PS+=DV; }
                if(DH>248) { DH=256-DH;T=PS;PS=PD;PD=T; }
                while((DV<8)&&!(*PD&(*PS>>DH))) { ++DV;++PS;++PD; }
                if(DV<8) return(1);
              }
            }
          }
  }

  /* No collisions */
  return(0);
}

