cristianoag/esp32_clones/software/esp32_msx_emulator/lib/fmsx/fMSX/MSX.c
/** StateID() ************************************************/
/** Compute 16bit emulation state ID used to identify .STA  **/
/** files.                                                  **/
/*************************************************************/
word StateID(void)
{
  word ID;
  int J,I;

  ID=0x0000;

  /* Add up cartridge ROMs, BIOS, BASIC, ExtBIOS, and DiskBIOS bytes */
  for(I=0;I<MAXSLOTS;++I)
    if(ROMData[I]) for(J=0;J<(ROMMask[I]+1)*0x2000;++J) ID+=I^ROMData[I][J];
  if(MemMap[0][0][0]&&(MemMap[0][0][0]!=EmptyRAM))
    for(J=0;J<0x8000;++J) ID+=MemMap[0][0][0][J];
  if(MemMap[3][1][0]&&(MemMap[3][1][0]!=EmptyRAM))
    for(J=0;J<0x4000;++J) ID+=MemMap[3][1][0][J];
  if(MemMap[3][1][2]&&(MemMap[3][1][2]!=EmptyRAM))
    for(J=0;J<0x4000;++J) ID+=MemMap[3][1][2][J];

  return(ID);
}

/** MakeFileName() *******************************************/
/** Make a copy of the file name, replacing the extension.  **/
/** Returns allocated new name or 0 on failure.             **/
/*************************************************************/
char *MakeFileName(const char *Name,const char *Ext)
{
  char *Result,*P1,*P2,*P3;

  Result = malloc(strlen(Name)+strlen(Ext)+1);
  if(!Result) return(0);
  strcpy(Result,Name);

  /* Locate where extension and filename actually start */
  P1 = strrchr(Result,'.');
  P2 = strrchr(Result,'/');
  P3 = strrchr(Result,'\\');
  P2 = P3 && (P3>P2)? P3:P2;
  P3 = strrchr(Result,':');
  P2 = P3 && (P3>P2)? P3:P2;

  if(P1 && (!P2 || (P1>P2))) strcpy(P1,Ext);
  else strcat(Result,Ext);

  return(Result);
}

/** ChangeTape() *********************************************/
/** Change tape image. ChangeTape(0) closes current image.  **/
/** Returns 1 on success, 0 on failure.                     **/
/*************************************************************/
byte ChangeTape(const char *FileName)
{
  static const byte Header[8]={0x1F,0xA6,0xDE,0xBA,0xCC,0x13,0x7D,0x74};
  FILE *Next=0;
  byte Buf[8];
  if(FileName&&*FileName)
  {
    Next=fopen(FileName,"rb");
    if(!Next) return(0);
    if(fread(Buf,1,8,Next)!=8||memcmp(Buf,Header,8)||fseek(Next,0,SEEK_SET))
    { fclose(Next);errno=EINVAL;return(0); }
  }
  if(CasStream) fclose(CasStream);
  CasStream=Next;
  return(1);
}

byte DiskROMAvailable(void)
{
  return(EmptyRAM&&(Mode&MSX_PATCHBDOS)&&MemMap[3][3][2]!=EmptyRAM);
}

/** RewindTape() *********************************************/
/** Rewind currenly open tape.                              **/
/*************************************************************/
void RewindTape(void) { if(CasStream) rewind(CasStream); }

/** ChangePrinter() ******************************************/
/** Change printer output to a given file. The previous     **/
/** file is closed. ChangePrinter(0) redirects output to    **/
/** stdout.                                                 **/
/*************************************************************/
void ChangePrinter(const char *FileName)
{
  if(PrnStream&&(PrnStream!=stdout)) fclose(PrnStream);
  PrnName   = FileName;
  PrnStream = 0;
}

/** ChangeDisk() *********************************************/
/** Change disk image in a given drive. Closes current disk **/
/** image if Name=0 or Name="" was given. Reads raw 360/720 **/
/** KiB images only; failure preserves the previous disk.  **/
/*************************************************************/
byte ChangeDisk(byte N,const char *FileName)
{
  FDIDisk Next;
  FILE *File;
  long Size;
  byte *P;
  if(N>=MAXDRIVES) return(0);
  if(!FileName||!*FileName)
  {
    Reset1793(&FDC,FDD,WD1793_KEEP);
    EjectFDI(&FDD[N]);
    return(1);
  }
  if(!DiskROMAvailable()) { errno=ENODEV;return(0); }
  File=fopen(FileName,"rb");
  if(!File) return(0);
  if(fseek(File,0,SEEK_END)||(Size=ftell(File))<0||
     (Size!=368640&&Size!=737280)||fseek(File,0,SEEK_SET))
  { fclose(File);errno=EINVAL;return(0); }
  InitFDI(&Next);
  P=NewFDI(&Next,Size==737280? 2:1,80,9,512);
  if(!P) { fclose(File);errno=ENOMEM;return(0); }
  if(fread(P,1,Size,File)!=(size_t)Size||fgetc(File)!=EOF||ferror(File))
  { fclose(File);EjectFDI(&Next);errno=EIO;return(0); }
  fclose(File);
  Next.Format=FMT_MSXDSK;
  Next.Data[3]=1;
  Next.Verbose=Verbose&0x04;
  /* Commit only after a complete read; never load an unrelated saved state. */
  Reset1793(&FDC,FDD,WD1793_KEEP);
  EjectFDI(&FDD[N]);
  FDD[N]=Next;
  return(1);
}

/** LoadFile() ***********************************************/
/** Simple utility function to load cartridge, state, font  **/
/** or a disk image, based on the file extension, etc.      **/
/*************************************************************/
int LoadFile(const char *FileName)
{
  int J;

  /* Try loading as a disk */
  if(hasext(FileName,".DSK")||hasext(FileName,".FDI"))
  {
    /* Change disk image in drive A: */
    if(!ChangeDisk(0,FileName)) return(0);
    /* Eject all user cartridges if successful */
    for(J=0;J<MAXCARTS;++J) LoadCart(0,J,ROMType[J]);
    /* Done */
    return(1);
  }

  /* Try loading as a cartridge */
  if(hasext(FileName,".ROM")||hasext(FileName,".MX1")||hasext(FileName,".MX2"))
    return(!!LoadCart(FileName,0,ROMGUESS(0)|ROMTYPE(0)));

  /* Try loading as a tape */
  if(hasext(FileName,".CAS")) return(!!ChangeTape(FileName));
  /* Try loading as a font */
  if(hasext(FileName,".FNT")) return(!!LoadFNT(FileName));
  /* Try loading as palette */
  if(hasext(FileName,".PAL")) return(!!LoadPAL(FileName));
  /* Try loading as cheats */
  if(hasext(FileName,".CHT")) return(!!LoadCHT(FileName));
  if(hasext(FileName,".MCF")) return(!!LoadMCF(FileName));
  /* Try loading as state */
  if(hasext(FileName,".STA")) return(!!LoadSTA(FileName));

  /* Unknown file type */
  return(0);
}

/** SaveCHT() ************************************************/
/** Save cheats to a given text file. Returns the number of **/
/** cheats on success, 0 on failure.                        **/
/*************************************************************/
int SaveCHT(const char *Name)
{
  FILE *F;
  int J;

  /* Open .CHT text file with cheats */
  F = fopen(Name,"wb");
  if(!F) return(0);

